% maxon RE30 12V
R  = 0.196;             % 抵抗[Ω]
L  = 0.034E-3;          % インダクタンス[H]
Kt = 2.9E-3;           % トルク定数[N*m/A]
J  = 15.7/100/100/1000; % 慣性モーメント[kg*m^2]
Kf = 0;                 % 粘性摩擦係数[N*m*s/rad]
Kb = Kt;   % 逆起電圧定数[V/rad/s]

% maxon RE30 12V
% R  = 0.196;             % 抵抗[Ω]
% L  = 0.034E-3;          % インダクタンス[H]
% Kt = 13.9E-3;           % トルク定数[N*m/A]
% J  = 33.7/100/100/1000; % 慣性モーメント[kg*m^2]
% Kf = 0;                 % 粘性摩擦係数[N*m*s/rad]
% Kb = 1/(685/60*2*pi);   % 逆起電圧定数[V/rad/s]

% maxon RE30 24V
% R  = 0.611;             % 抵抗[Ω]
% L  = 0.119E-3;          % インダクタンス[H]
% Kt = 25.9E-3;           % トルク定数[N*m/A]
% J  = 33.3/100/100/1000; % 慣性モーメント[kg*m^2]
% Kf = 0;                 % 粘性摩擦係数[N*m*s/rad]
% Kb = 1/(369/60*2*pi);   % 逆起電圧定数[V/rad/s]
